app/Controllers/Dashboard.php

    public function member()
    {

        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $data['userdata'] = session()->get();
        $role = $data['userdata']['role'];
        $userId = $data['userdata']['id'];

        $mitraModel = new Mitra();
        $config = new Configs();
        $members = new Member();
        $paket = new Membership();
        $user = new User();

        $data['pakets'] = $paket->findAll();
        $data['users'] = $user->findAll();
---
SELECT *
FROM `users`