app/Controllers/Home.php

    public function registerMember()
    {
        $memberModel = new Member();

        $data = [
            'nama' => $this->request->getPost('nama'),
            'email' => $this->request->getPost('email'),
            'telepon' => $this->request->getPost('telepon'),
            'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
            'id_paket_membership' => $this->request->getPost('id_paket_membership'),
        ];

        $memberModel->save($data);
---
INSERT INTO `members` (`nama`, `email`, `telepon`, `jenis_kelamin`, `id_paket_membership`) VALUES ('Contoh member daftar onlen', 'memberonlie@gmail.com', '087766554433', 'pria', '2')