app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'mitra'
 LIMIT 1
---
    public function login()
    {
        // Menetapkan aturan validasi untuk form login.
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        // Memeriksa apakah form valid sesuai dengan aturan.
        if ($this->validate($rules)) {
            // Mengambil data dari form login.
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            // Membuat instance baru dari model User.
            $userModel = new User();

            // Mencari pengguna berdasarkan username.
            $user = $userModel->where('username', $username)->first();