app/Models/Configs.php

SELECT *
FROM `configs`
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function dataConfig()
    {
        // Mengambil satu baris data dari tabel `configs`, diurutkan berdasarkan kolom `created_at` secara descending (terbaru dulu).
        return $this->orderBy('created_at', 'DESC')->first();