app/Models/Member.php

    public function getMembersWithDetails($mitraId = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('members.*, paket_membership.jangka_waktu, users.username');
        $builder->join('paket_membership', 'paket_membership.id = members.id_paket_membership', 'left');
        $builder->join('users', 'users.id = members.id_mitra', 'left');

        if ($mitraId !== null) {
            $builder->where('members.id_mitra', $mitraId);
        }

        return $builder->get()->getResultArray();
---
SELECT `members`.*, `paket_membership`.`jangka_waktu`, `users`.`username`
FROM `members`
LEFT JOIN `paket_membership` ON `paket_membership`.`id` = `members`.`id_paket_membership`
LEFT JOIN `users` ON `users`.`id` = `members`.`id_mitra`
WHERE `members`.`id_mitra` = '2'