app/Models/Mitra.php

SELECT `mitra`.*
FROM `mitra`
---
    public function fetchAllMitra()
    {
        // Memulai pembangunan query menggunakan Query Builder untuk mengambil semua data mitra.
        return $this->select('mitra.*')
                        ->findAll();